app/controllers/chats_controller.rb

  def show
    @chat = Chat.find(params[:id])
---
SELECT * FROM `chats` WHERE (`chats`.`id` = 1)

  def edit
    @chat = Chat.find(params[:id])
---
SELECT * FROM `chats` WHERE (`chats`.`id` = 1)

  def create

    @chat = Chat.find(params[:chat_id])
    @comment = @chat.comments.create(params[:comment])
---
INSERT INTO `chats` (`created_at`, `updated_at`, `user_id`, `message`) VALUES('2010-03-26 20:26:44', '2010-03-26 20:26:44', NULL, 'hi')

  def update
    @chat = Chat.find(params[:id])

    respond_to do |format|
      if @chat.update_attributes(params[:chat])
---
SELECT * FROM `chats` WHERE (`chats`.`id` = 1)
UPDATE `chats` SET `updated_at` = '2010-03-26 20:27:01', `message` = 'hiya' WHERE `id` = 1